In [87]:
#basic
import pandas as pd
import numpy as np
import datetime
import re
from pandas.tseries.holiday import USFederalHolidayCalendar

In [2]:
df = pd.read_csv('coast_df.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109535 entries, 0 to 109534
Data columns (total 3 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Unnamed: 0  109535 non-null  int64
 1   datetime    109535 non-null  object
 2   ercot_load  109534 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.5+ MB

In [4]:
df.head(30)

    Unnamed: 0                    datetime   ercot_load
0            0  2010-01-01 01:00:00.003000  7775.456846
1            1  2010-01-01 01:59:59.997000  7704.815982
2            2         2010-01-01 03:00:00  7650.575724
3            3  2010-01-01 04:00:00.003000  7666.708317
4            4  2010-01-01 04:59:59.997000  7744.960869
5            5         2010-01-01 06:00:00  7980.653429
6            6  2010-01-01 07:00:00.003000  8197.656921
7            7  2010-01-01 07:59:59.997000  8323.466717
8            8         2010-01-01 09:00:00  8445.652540
9            9  2010-01-01 10:00:00.003000  8682.288354
10          10  2010-01-01 10:59:59.997000  8783.462969
11          11         2010-01-01 12:00:00  8810.251800
12          12  2010-01-01 13:00:00.003000  8651.043662
13          13  2010-01-01 13:59:59.997000  8449.118385
14          14         2010-01-01 15:00:00  8222.029420
15          15  2010-01-01 16:00:00.003000  8055.582780
16          16  2010-01-01 16:59:59.997000  8155.932078
17          17         2010-01-01 18:00:00  8620.029504
18          18  2010-01-01 19:00:00.003000  9136.176022
19          19  2010-01-01 19:59:59.997000  9258.353529
20          20         2010-01-01 21:00:00  9204.682507
21          21  2010-01-01 22:00:00.003000  9050.982432
22          22  2010-01-01 22:59:59.997000  8816.746381
23          23         2010-01-02 00:00:00  8515.792400
24          24  2010-01-02 01:00:00.003000  8279.044452
25          25  2010-01-02 01:59:59.997000  8130.664762
26          26         2010-01-02 03:00:00  8049.185313
27          27  2010-01-02 04:00:00.003000  8095.660424
28          28  2010-01-02 04:59:59.997000  8217.184166
29          29         2010-01-02 06:00:00  8436.457676

In [5]:
df.drop(columns=['Unnamed: 0'],inplace=True)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109535 entries, 0 to 109534
Data columns (total 2 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   datetime    109535 non-null  object
 1   ercot_load  109534 non-null  float64
dtypes: float64(1), object(1)
memory usage: 1.7+ MB

In [7]:
df.tail()

                datetime    ercot_load
109530  06/30/2022 20:00  14700.132848
109531  06/30/2022 21:00  14637.633680
109532  06/30/2022 22:00  14543.743791
109533  06/30/2022 23:00  14065.386852
109534  06/30/2022 24:00  13484.378935

In [8]:
df[~df.datetime.str.startswith('2')]

                datetime    ercot_load
61368   01/01/2017 01:00   8791.789509
61369   01/01/2017 02:00   8569.708419
61370   01/01/2017 03:00   8326.425638
61371   01/01/2017 04:00   8137.497400
61372   01/01/2017 05:00   8011.869581
...                  ...           ...
109530  06/30/2022 20:00  14700.132848
109531  06/30/2022 21:00  14637.633680
109532  06/30/2022 22:00  14543.743791
109533  06/30/2022 23:00  14065.386852
109534  06/30/2022 24:00  13484.378935

[48167 rows x 2 columns]

In [9]:
df.head(15)

                      datetime   ercot_load
0   2010-01-01 01:00:00.003000  7775.456846
1   2010-01-01 01:59:59.997000  7704.815982
2          2010-01-01 03:00:00  7650.575724
3   2010-01-01 04:00:00.003000  7666.708317
4   2010-01-01 04:59:59.997000  7744.960869
5          2010-01-01 06:00:00  7980.653429
6   2010-01-01 07:00:00.003000  8197.656921
7   2010-01-01 07:59:59.997000  8323.466717
8          2010-01-01 09:00:00  8445.652540
9   2010-01-01 10:00:00.003000  8682.288354
10  2010-01-01 10:59:59.997000  8783.462969
11         2010-01-01 12:00:00  8810.251800
12  2010-01-01 13:00:00.003000  8651.043662
13  2010-01-01 13:59:59.997000  8449.118385
14         2010-01-01 15:00:00  8222.029420

In [10]:
df.shape

(109535, 2)

In [11]:
df.datetime.isna().sum()

0

In [12]:
df.datetime[0]

'2010-01-01 01:00:00.003000'

In [13]:
df.datetime.apply(len).value_counts()

16    48162
26    40912
19    20456
20        5
Name: datetime, dtype: int64

In [14]:
df.datetime.str[:16]

0         2010-01-01 01:00
1         2010-01-01 01:59
2         2010-01-01 03:00
3         2010-01-01 04:00
4         2010-01-01 04:59
                ...
109530    06/30/2022 20:00
109531    06/30/2022 21:00
109532    06/30/2022 22:00
109533    06/30/2022 23:00
109534    06/30/2022 24:00
Name: datetime, Length: 109535, dtype: object

In [15]:
# 1. Datetime to string
# 2. Pull out first 19 characters
df.datetime = df.datetime.str[:16]

df.head(3)

           datetime   ercot_load
0  2010-01-01 01:00  7775.456846
1  2010-01-01 01:59  7704.815982
2  2010-01-01 03:00  7650.575724

In [16]:
df.datetime.str[:10]

0         2010-01-01
1         2010-01-01
2         2010-01-01
3         2010-01-01
4         2010-01-01
             ...
109530    06/30/2022
109531    06/30/2022
109532    06/30/2022
109533    06/30/2022
109534    06/30/2022
Name: datetime, Length: 109535, dtype: object

In [17]:
df.datetime.str[-5:]

0         01:00
1         01:59
2         03:00
3         04:00
4         04:59
          ...
109530    20:00
109531    21:00
109532    22:00
109533    23:00
109534    24:00
Name: datetime, Length: 109535, dtype: object

In [18]:
# 3. Deconstruct into date and time columns
df['date'] = df.datetime.str[:10]
df['time'] = df.datetime.str[-5:]

In [19]:
df

                datetime    ercot_load        date   time
0       2010-01-01 01:00   7775.456846  2010-01-01  01:00
1       2010-01-01 01:59   7704.815982  2010-01-01  01:59
2       2010-01-01 03:00   7650.575724  2010-01-01  03:00
3       2010-01-01 04:00   7666.708317  2010-01-01  04:00
4       2010-01-01 04:59   7744.960869  2010-01-01  04:59
...                  ...           ...         ...    ...
109530  06/30/2022 20:00  14700.132848  06/30/2022  20:00
109531  06/30/2022 21:00  14637.633680  06/30/2022  21:00
109532  06/30/2022 22:00  14543.743791  06/30/2022  22:00
109533  06/30/2022 23:00  14065.386852  06/30/2022  23:00
109534  06/30/2022 24:00  13484.378935  06/30/2022  24:00

[109535 rows x 4 columns]

In [20]:
pd.to_datetime(df.date)

0        2010-01-01
1        2010-01-01
2        2010-01-01
3        2010-01-01
4        2010-01-01
            ...
109530   2022-06-30
109531   2022-06-30
109532   2022-06-30
109533   2022-06-30
109534   2022-06-30
Name: date, Length: 109535, dtype: datetime64[ns]

In [21]:
# 4. Convert date column into datetime format
df['date'] = pd.to_datetime(df.date)
#NOTE: may need to come back here and specify datetime format to store it as
# if date addition or similar doesn't work

df

                datetime    ercot_load       date   time
0       2010-01-01 01:00   7775.456846 2010-01-01  01:00
1       2010-01-01 01:59   7704.815982 2010-01-01  01:59
2       2010-01-01 03:00   7650.575724 2010-01-01  03:00
3       2010-01-01 04:00   7666.708317 2010-01-01  04:00
4       2010-01-01 04:59   7744.960869 2010-01-01  04:59
...                  ...           ...        ...    ...
109530  06/30/2022 20:00  14700.132848 2022-06-30  20:00
109531  06/30/2022 21:00  14637.633680 2022-06-30  21:00
109532  06/30/2022 22:00  14543.743791 2022-06-30  22:00
109533  06/30/2022 23:00  14065.386852 2022-06-30  23:00
109534  06/30/2022 24:00  13484.378935 2022-06-30  24:00

[109535 rows x 4 columns]

In [22]:
# 5. Find any time where starts with 24, then for that index, update time to 00 and add one day to to date column
df.time.str[:2].value_counts()

01    7121
10    7121
22    7121
16    7121
13    7121
19    7121
07    7121
04    7121
09    4564
12    4564
15    4564
06    4564
18    4564
21    4564
03    4558
00    2557
02    2012
05    2007
08    2007
11    2007
14    2007
17    2007
20    2007
23    2007
24    2007
Name: time, dtype: int64

In [23]:
df[df.time.str.startswith('24')]

                datetime    ercot_load       date   time
61391   01/01/2017 24:00   9287.697168 2017-01-01  24:00
61415   01/02/2017 24:00   8935.488453 2017-01-02  24:00
61439   01/03/2017 24:00   8916.940782 2017-01-03  24:00
61463   01/04/2017 24:00   9784.496622 2017-01-04  24:00
61487   01/05/2017 24:00   9959.715620 2017-01-05  24:00
...                  ...           ...        ...    ...
109438  06/26/2022 24:00  16630.511189 2022-06-26  24:00
109462  06/27/2022 24:00  13866.196748 2022-06-27  24:00
109486  06/28/2022 24:00  14675.349674 2022-06-28  24:00
109510  06/29/2022 24:00  14877.471376 2022-06-29  24:00
109534  06/30/2022 24:00  13484.378935 2022-06-30  24:00

[2007 rows x 4 columns]

In [24]:
df.loc[61389:61393]

               datetime    ercot_load       date   time
61389  01/01/2017 22:00  10014.826690 2017-01-01  22:00
61390  01/01/2017 23:00   9667.707936 2017-01-01  23:00
61391  01/01/2017 24:00   9287.697168 2017-01-01  24:00
61392  01/02/2017 01:00   8836.827197 2017-01-02  01:00
61393  01/02/2017 02:00   8588.171497 2017-01-02  02:00

In [25]:
df.loc[109436:109440]

                datetime    ercot_load       date   time
109436  06/26/2022 22:00  18740.491769 2022-06-26  22:00
109437  06/26/2022 23:00  17737.561633 2022-06-26  23:00
109438  06/26/2022 24:00  16630.511189 2022-06-26  24:00
109439  06/27/2022 01:00  15353.602834 2022-06-27  01:00
109440  06/27/2022 02:00  14580.011779 2022-06-27  02:00

In [26]:
# 5. Find any time where starts with 24, then for that index, add one day to to date column and update time to 00

In [27]:
df.loc[df.time.str.startswith('24'),'date'] = df.date + datetime.timedelta(days=1)

In [28]:
df.loc[61389:61393]

               datetime    ercot_load       date   time
61389  01/01/2017 22:00  10014.826690 2017-01-01  22:00
61390  01/01/2017 23:00   9667.707936 2017-01-01  23:00
61391  01/01/2017 24:00   9287.697168 2017-01-02  24:00
61392  01/02/2017 01:00   8836.827197 2017-01-02  01:00
61393  01/02/2017 02:00   8588.171497 2017-01-02  02:00

In [29]:
df.loc[109436:109440]

                datetime    ercot_load       date   time
109436  06/26/2022 22:00  18740.491769 2022-06-26  22:00
109437  06/26/2022 23:00  17737.561633 2022-06-26  23:00
109438  06/26/2022 24:00  16630.511189 2022-06-27  24:00
109439  06/27/2022 01:00  15353.602834 2022-06-27  01:00
109440  06/27/2022 02:00  14580.011779 2022-06-27  02:00

In [32]:
df.loc[109438,'time']

'24:00'

In [33]:
re.sub(r'24:','00:',df.loc[109438,'time'])

'00:00'

In [35]:
df.time.apply(lambda x: re.sub(r'24:','00:',x))

0         01:00
1         01:59
2         03:00
3         04:00
4         04:59
          ...
109530    20:00
109531    21:00
109532    22:00
109533    23:00
109534    00:00
Name: time, Length: 109535, dtype: object

In [37]:
df.time = df.time.apply(lambda x: re.sub(r'24:','00:',x))

In [38]:
df.loc[61389:61393]

               datetime    ercot_load       date   time
61389  01/01/2017 22:00  10014.826690 2017-01-01  22:00
61390  01/01/2017 23:00   9667.707936 2017-01-01  23:00
61391  01/01/2017 24:00   9287.697168 2017-01-02  00:00
61392  01/02/2017 01:00   8836.827197 2017-01-02  01:00
61393  01/02/2017 02:00   8588.171497 2017-01-02  02:00

In [39]:
df.loc[109436:109440]

                datetime    ercot_load       date   time
109436  06/26/2022 22:00  18740.491769 2022-06-26  22:00
109437  06/26/2022 23:00  17737.561633 2022-06-26  23:00
109438  06/26/2022 24:00  16630.511189 2022-06-27  00:00
109439  06/27/2022 01:00  15353.602834 2022-06-27  01:00
109440  06/27/2022 02:00  14580.011779 2022-06-27  02:00

In [40]:
df.date.astype(str)

0         2010-01-01
1         2010-01-01
2         2010-01-01
3         2010-01-01
4         2010-01-01
             ...
109530    2022-06-30
109531    2022-06-30
109532    2022-06-30
109533    2022-06-30
109534    2022-07-01
Name: date, Length: 109535, dtype: object

In [41]:
# 6. Check indices where known issue
df['new_datetime'] = df.date.astype(str) + ' ' + df.time

df

                datetime    ercot_load       date   time      new_datetime
0       2010-01-01 01:00   7775.456846 2010-01-01  01:00  2010-01-01 01:00
1       2010-01-01 01:59   7704.815982 2010-01-01  01:59  2010-01-01 01:59
2       2010-01-01 03:00   7650.575724 2010-01-01  03:00  2010-01-01 03:00
3       2010-01-01 04:00   7666.708317 2010-01-01  04:00  2010-01-01 04:00
4       2010-01-01 04:59   7744.960869 2010-01-01  04:59  2010-01-01 04:59
...                  ...           ...        ...    ...               ...
109530  06/30/2022 20:00  14700.132848 2022-06-30  20:00  2022-06-30 20:00
109531  06/30/2022 21:00  14637.633680 2022-06-30  21:00  2022-06-30 21:00
109532  06/30/2022 22:00  14543.743791 2022-06-30  22:00  2022-06-30 22:00
109533  06/30/2022 23:00  14065.386852 2022-06-30  23:00  2022-06-30 23:00
109534  06/30/2022 24:00  13484.378935 2022-07-01  00:00  2022-07-01 00:00

[109535 rows x 5 columns]

In [42]:
# 9. Convert datetime column to datetime
df['new_datetime'] = pd.to_datetime(df.new_datetime)

In [43]:
df.head()

           datetime   ercot_load       date   time        new_datetime
0  2010-01-01 01:00  7775.456846 2010-01-01  01:00 2010-01-01 01:00:00
1  2010-01-01 01:59  7704.815982 2010-01-01  01:59 2010-01-01 01:59:00
2  2010-01-01 03:00  7650.575724 2010-01-01  03:00 2010-01-01 03:00:00
3  2010-01-01 04:00  7666.708317 2010-01-01  04:00 2010-01-01 04:00:00
4  2010-01-01 04:59  7744.960869 2010-01-01  04:59 2010-01-01 04:59:00

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 109535 entries, 0 to 109534
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   datetime      109535 non-null  object
 1   ercot_load    109534 non-null  float64
 2   date          109535 non-null  datetime64[ns]
 3   time          109535 non-null  object
 4   new_datetime  109535 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(1), object(2)
memory usage: 4.2+ MB

In [45]:
df.loc[61389:61393]

               datetime    ercot_load       date   time        new_datetime
61389  01/01/2017 22:00  10014.826690 2017-01-01  22:00 2017-01-01 22:00:00
61390  01/01/2017 23:00   9667.707936 2017-01-01  23:00 2017-01-01 23:00:00
61391  01/01/2017 24:00   9287.697168 2017-01-02  00:00 2017-01-02 00:00:00
61392  01/02/2017 01:00   8836.827197 2017-01-02  01:00 2017-01-02 01:00:00
61393  01/02/2017 02:00   8588.171497 2017-01-02  02:00 2017-01-02 02:00:00

In [46]:
df.loc[109436:109440]

                datetime    ercot_load       date   time        new_datetime
109436  06/26/2022 22:00  18740.491769 2022-06-26  22:00 2022-06-26 22:00:00
109437  06/26/2022 23:00  17737.561633 2022-06-26  23:00 2022-06-26 23:00:00
109438  06/26/2022 24:00  16630.511189 2022-06-27  00:00 2022-06-27 00:00:00
109439  06/27/2022 01:00  15353.602834 2022-06-27  01:00 2022-06-27 01:00:00
109440  06/27/2022 02:00  14580.011779 2022-06-27  02:00 2022-06-27 02:00:00

In [48]:
df.new_datetime = df.new_datetime.dt.round("H")

df

                datetime    ercot_load       date   time        new_datetime
0       2010-01-01 01:00   7775.456846 2010-01-01  01:00 2010-01-01 01:00:00
1       2010-01-01 01:59   7704.815982 2010-01-01  01:59 2010-01-01 02:00:00
2       2010-01-01 03:00   7650.575724 2010-01-01  03:00 2010-01-01 03:00:00
3       2010-01-01 04:00   7666.708317 2010-01-01  04:00 2010-01-01 04:00:00
4       2010-01-01 04:59   7744.960869 2010-01-01  04:59 2010-01-01 05:00:00
...                  ...           ...        ...    ...                 ...
109530  06/30/2022 20:00  14700.132848 2022-06-30  20:00 2022-06-30 20:00:00
109531  06/30/2022 21:00  14637.633680 2022-06-30  21:00 2022-06-30 21:00:00
109532  06/30/2022 22:00  14543.743791 2022-06-30  22:00 2022-06-30 22:00:00
109533  06/30/2022 23:00  14065.386852 2022-06-30  23:00 2022-06-30 23:00:00
109534  06/30/2022 24:00  13484.378935 2022-07-01  00:00 2022-07-01 00:00:00

[109535 rows x 5 columns]

In [ ]:
# 1. Datetime to string
# df.datetime = df.datetime[:19]
# 2. Pull out first 16 characters
# 3. Deconstruct into date and time columns
# 4. Convert date column into datetime format
# 5. Find any time where starts with 24, then for that index, update time to 00 and add one day to to date column
# 6. Check indices where known issue
# 7. Convert date column back to string
# 8. Concat date and time column >> datetime
# 9. Convert datetime column to datetime
# 10. Perform dt.round

In [63]:
#drop unneeded columns
df.drop(columns=['datetime','date','time'],inplace=True)

In [64]:
df.head()

    ercot_load        new_datetime
0  7775.456846 2010-01-01 01:00:00
1  7704.815982 2010-01-01 02:00:00
2  7650.575724 2010-01-01 03:00:00
3  7666.708317 2010-01-01 04:00:00
4  7744.960869 2010-01-01 05:00:00

In [65]:
#rename column and set as index
df.rename(columns={'new_datetime':'datetime'},inplace=True)
df = df.set_index('datetime').sort_index()
df.head()

                      ercot_load
datetime
2010-01-01 01:00:00  7775.456846
2010-01-01 02:00:00  7704.815982
2010-01-01 03:00:00  7650.575724
2010-01-01 04:00:00  7666.708317
2010-01-01 05:00:00  7744.960869

### Drop these actions in a function

In [69]:
def clean_ercot_datetime(df):
    '''
    This function is designed to take in our coast_df.csv and clean up the datetimes that were provided.
    - gets dates in same format and stored as datetime
    - adjusts any 24:00 entries to be 00: the following day
    - Stores the datetime as the index
    
    Returns: Pandas Dateframe - w/ datetime index and load column
    Parameters: df: pandas dataframe - expecting our coast_df.csv file
    '''
    # 1. Pull out first 16 characters
    df.datetime = df.datetime.str[:16]
    # 2. Deconstruct into date and time columns
    df['date'] = df.datetime.str[:10]
    df['time'] = df.datetime.str[-5:]
    # 3. Convert date column into datetime format
    df['date'] = pd.to_datetime(df.date)
    
    # 4. Find any time where starts with 24, then for that index, add one day to to date column then update time to 00
    #For all indices w/ a time that starts with 24, add one day to the date
    df.loc[df.time.str.startswith('24'),'date'] = df.date + datetime.timedelta(days=1)
    #Replace all '24:' in time with '00:'
    df.time = df.time.apply(lambda x: re.sub(r'24:','00:',x))

    # 5. Convert date column back to string and Concat date and time column >> datetime
    df['new_datetime'] = df.date.astype(str) + ' ' + df.time
    
    # 6. Convert new datetime column to datetime
    df['new_datetime'] = pd.to_datetime(df.new_datetime)
    
    # 7. Perform dt.round
    df.new_datetime = df.new_datetime.dt.round("H")
    
    # 8. Drop old date/time columns and index
    df.drop(columns=['datetime','date','time','Unnamed: 0'],inplace=True)
    
    # 9. Rename datetime column and set as index
    df.rename(columns={'new_datetime':'datetime'},inplace=True)
    df = df.set_index('datetime').sort_index()
    
    return df

##### Test function

In [70]:
test_clean = pd.read_csv('coast_df.csv')
test_clean

        Unnamed: 0                    datetime    ercot_load
0                0  2010-01-01 01:00:00.003000   7775.456846
1                1  2010-01-01 01:59:59.997000   7704.815982
2                2         2010-01-01 03:00:00   7650.575724
3                3  2010-01-01 04:00:00.003000   7666.708317
4                4  2010-01-01 04:59:59.997000   7744.960869
...            ...                         ...           ...
109530        4338            06/30/2022 20:00  14700.132848
109531        4339            06/30/2022 21:00  14637.633680
109532        4340            06/30/2022 22:00  14543.743791
109533        4341            06/30/2022 23:00  14065.386852
109534        4342            06/30/2022 24:00  13484.378935

[109535 rows x 3 columns]

In [71]:
test_clean = clean_ercot_datetime(test_clean)
test_clean

                       ercot_load
datetime
2010-01-01 01:00:00   7775.456846
2010-01-01 02:00:00   7704.815982
2010-01-01 03:00:00   7650.575724
2010-01-01 04:00:00   7666.708317
2010-01-01 05:00:00   7744.960869
...                           ...
2022-06-30 20:00:00  14700.132848
2022-06-30 21:00:00  14637.633680
2022-06-30 22:00:00  14543.743791
2022-06-30 23:00:00  14065.386852
2022-07-01 00:00:00  13484.378935

[109535 rows x 1 columns]

### Add new features on day type

In [72]:
df2 = test_clean.copy()

In [73]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 109535 entries, 2010-01-01 01:00:00 to 2022-07-01 00:00:00
Data columns (total 1 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   ercot_load  109534 non-null  float64
dtypes: float64(1)
memory usage: 1.7 MB

In [74]:
df2['dow'] = df2.index.day_name()
df2

                       ercot_load       dow
datetime
2010-01-01 01:00:00   7775.456846    Friday
2010-01-01 02:00:00   7704.815982    Friday
2010-01-01 03:00:00   7650.575724    Friday
2010-01-01 04:00:00   7666.708317    Friday
2010-01-01 05:00:00   7744.960869    Friday
...                           ...       ...
2022-06-30 20:00:00  14700.132848  Thursday
2022-06-30 21:00:00  14637.633680  Thursday
2022-06-30 22:00:00  14543.743791  Thursday
2022-06-30 23:00:00  14065.386852  Thursday
2022-07-01 00:00:00  13484.378935    Friday

[109535 rows x 2 columns]

In [81]:
df2.dow.apply(lambda x: 0 if x in (['Saturday','Sunday']) else 1).head(26)

datetime
2010-01-01 01:00:00    1
2010-01-01 02:00:00    1
2010-01-01 03:00:00    1
2010-01-01 04:00:00    1
2010-01-01 05:00:00    1
2010-01-01 06:00:00    1
2010-01-01 07:00:00    1
2010-01-01 08:00:00    1
2010-01-01 09:00:00    1
2010-01-01 10:00:00    1
2010-01-01 11:00:00    1
2010-01-01 12:00:00    1
2010-01-01 13:00:00    1
2010-01-01 14:00:00    1
2010-01-01 15:00:00    1
2010-01-01 16:00:00    1
2010-01-01 17:00:00    1
2010-01-01 18:00:00    1
2010-01-01 19:00:00    1
2010-01-01 20:00:00    1
2010-01-01 21:00:00    1
2010-01-01 22:00:00    1
2010-01-01 23:00:00    1
2010-01-02 00:00:00    0
2010-01-02 01:00:00    0
2010-01-02 02:00:00    0
Name: dow, dtype: int64

In [82]:
df2['is_weekday'] = df2.dow.apply(lambda x: 0 if x in (['Saturday','Sunday']) else 1)

In [83]:
df2.head(25)

                      ercot_load       dow  is_weekday
datetime
2010-01-01 01:00:00  7775.456846    Friday           1
2010-01-01 02:00:00  7704.815982    Friday           1
2010-01-01 03:00:00  7650.575724    Friday           1
2010-01-01 04:00:00  7666.708317    Friday           1
2010-01-01 05:00:00  7744.960869    Friday           1
2010-01-01 06:00:00  7980.653429    Friday           1
2010-01-01 07:00:00  8197.656921    Friday           1
2010-01-01 08:00:00  8323.466717    Friday           1
2010-01-01 09:00:00  8445.652540    Friday           1
2010-01-01 10:00:00  8682.288354    Friday           1
2010-01-01 11:00:00  8783.462969    Friday           1
2010-01-01 12:00:00  8810.251800    Friday           1
2010-01-01 13:00:00  8651.043662    Friday           1
2010-01-01 14:00:00  8449.118385    Friday           1
2010-01-01 15:00:00  8222.029420    Friday           1
2010-01-01 16:00:00  8055.582780    Friday           1
2010-01-01 17:00:00  8155.932078    Friday           1
2010-01-01 18:00:00  8620.029504    Friday           1
2010-01-01 19:00:00  9136.176022    Friday           1
2010-01-01 20:00:00  9258.353529    Friday           1
2010-01-01 21:00:00  9204.682507    Friday           1
2010-01-01 22:00:00  9050.982432    Friday           1
2010-01-01 23:00:00  8816.746381    Friday           1
2010-01-02 00:00:00  8515.792400  Saturday           0
2010-01-02 01:00:00  8279.044452  Saturday           0

In [84]:
2/7

0.2857142857142857

In [86]:
1- df2.is_weekday.mean()

0.28570776464143877

In [88]:
#NOW figure out our holiday options
cal = USFederalHolidayCalendar() #

In [90]:
cal.rules

[Holiday: New Years Day (month=1, day=1, observance=<function nearest_workday at 0x7fe54c5b4160>),
 Holiday: Martin Luther King Jr. Day (month=1, day=1, offset=<DateOffset: weekday=MO(+3)>),
 Holiday: Presidents Day (month=2, day=1, offset=<DateOffset: weekday=MO(+3)>),
 Holiday: Memorial Day (month=5, day=31, offset=<DateOffset: weekday=MO(-1)>),
 Holiday: July 4th (month=7, day=4, observance=<function nearest_workday at 0x7fe54c5b4160>),
 Holiday: Labor Day (month=9, day=1, offset=<DateOffset: weekday=MO(+1)>),
 Holiday: Columbus Day (month=10, day=1, offset=<DateOffset: weekday=MO(+2)>),
 Holiday: Veterans Day (month=11, day=11, observance=<function nearest_workday at 0x7fe54c5b4160>),
 Holiday: Thanksgiving (month=11, day=1, offset=<DateOffset: weekday=TH(+4)>),
 Holiday: Christmas (month=12, day=25, observance=<function nearest_workday at 0x7fe54c5b4160>)]

Looks like the usfederal calendar from pandas already contains the logic on observance days

In [101]:
df2.index[0]

Timestamp('2010-01-01 01:00:00')

In [103]:
df2.index[-1]

Timestamp('2022-07-01 00:00:00')

In [128]:
#Let's look at the holidays
start = df2.index[0] - datetime.timedelta(days=1) #this is need b/c it will skip 1/1/2010 (I think b/c it starts at one hour into that day)
end = df2.index[-1] + datetime.timedelta(days=1)
obsholidays = cal.holidays(start, end) #returns datetime index
obsholiday_names = cal.holidays(start, end, return_name = True) #returns series
print(f'start date: {start}\nend date: {end}')

start date: 2009-12-31 01:00:00
end date: 2022-07-02 00:00:00

In [130]:
obsholidays

DatetimeIndex(['2010-01-01', '2010-01-18', '2010-02-15', '2010-05-31',
               '2010-07-05', '2010-09-06', '2010-10-11', '2010-11-11',
               '2010-11-25', '2010-12-24',
               ...
               '2021-07-05', '2021-09-06', '2021-10-11', '2021-11-11',
               '2021-11-25', '2021-12-24', '2021-12-31', '2022-01-17',
               '2022-02-21', '2022-05-30'],
              dtype='datetime64[ns]', length=124, freq=None)

In [132]:
type(obsholiday_names)

pandas.core.series.Series

In [134]:
#convert the dates from above into day of week, then see distribution
pd.Series(pd.to_datetime(obsholiday_names.index).dayofweek).value_counts()

0    77
3    18
4    15
2     8
1     6
dtype: int64

No Saturdays/Sundays shows that this is only OBSERVED holidays

In [140]:
df2.index.isin(obsholidays)

array([False, False, False, ..., False, False, False])

In [142]:
df2.index.isin(obsholidays).astype(int)

array([0, 0, 0, ..., 0, 0, 0])

In [141]:
df2.index.isin(obsholidays).sum()

123

In [143]:
df2['is_obs_holiday'] = df2.index.isin(obsholidays).astype(int)

In [144]:
df2.head(20)

                      ercot_load     dow  is_weekday  is_obs_holiday
datetime
2010-01-01 01:00:00  7775.456846  Friday           1               0
2010-01-01 02:00:00  7704.815982  Friday           1               0
2010-01-01 03:00:00  7650.575724  Friday           1               0
2010-01-01 04:00:00  7666.708317  Friday           1               0
2010-01-01 05:00:00  7744.960869  Friday           1               0
2010-01-01 06:00:00  7980.653429  Friday           1               0
2010-01-01 07:00:00  8197.656921  Friday           1               0
2010-01-01 08:00:00  8323.466717  Friday           1               0
2010-01-01 09:00:00  8445.652540  Friday           1               0
2010-01-01 10:00:00  8682.288354  Friday           1               0
2010-01-01 11:00:00  8783.462969  Friday           1               0
2010-01-01 12:00:00  8810.251800  Friday           1               0
2010-01-01 13:00:00  8651.043662  Friday           1               0
2010-01-01 14:00:00  8449.118385  Friday           1               0
2010-01-01 15:00:00  8222.029420  Friday           1               0
2010-01-01 16:00:00  8055.582780  Friday           1               0
2010-01-01 17:00:00  8155.932078  Friday           1               0
2010-01-01 18:00:00  8620.029504  Friday           1               0
2010-01-01 19:00:00  9136.176022  Friday           1               0
2010-01-01 20:00:00  9258.353529  Friday           1               0

**NOT WORKING** This is I think because it doesn't like the time on it.  It may be counting that as the next day (similar to how a start datetime of 1am on 1/1 didn't return us the 1/1 holiday)

**Instead:** convert datetime to datetime (days), then check the list

In [147]:
pd.to_datetime(df2.index,unit='D').isin(obsholidays).astype(int) #didn't work

array([0, 0, 0, ..., 0, 0, 0])

In [152]:
df2.index.date

array([datetime.date(2010, 1, 1), datetime.date(2010, 1, 1),
       datetime.date(2010, 1, 1), ..., datetime.date(2022, 6, 30),
       datetime.date(2022, 6, 30), datetime.date(2022, 7, 1)],
      dtype=object)

In [151]:
pd.Series(df2.index.date).isin(obsholidays).astype(int)

/opt/homebrew/anaconda3/lib/python3.9/site-packages/pandas/core/algorithms.py:524: FutureWarning: Comparison of Timestamp with datetime.date is deprecated in order to match the standard library behavior.  In a future version these will be considered non-comparable.Use 'ts == pd.Timestamp(date)' or 'ts.date() == date' instead.
  return f(comps, values)

0         0
1         0
2         0
3         0
4         0
         ..
109530    0
109531    0
109532    0
109533    0
109534    0
Length: 109535, dtype: int64

In [155]:
pd.Series(df2.index).dt.date

0         2010-01-01
1         2010-01-01
2         2010-01-01
3         2010-01-01
4         2010-01-01
             ...
109530    2022-06-30
109531    2022-06-30
109532    2022-06-30
109533    2022-06-30
109534    2022-07-01
Name: datetime, Length: 109535, dtype: object

In [161]:
obsholidays.date

array([datetime.date(2010, 1, 1), datetime.date(2010, 1, 18),
       datetime.date(2010, 2, 15), datetime.date(2010, 5, 31),
       datetime.date(2010, 7, 5), datetime.date(2010, 9, 6),
       datetime.date(2010, 10, 11), datetime.date(2010, 11, 11),
       datetime.date(2010, 11, 25), datetime.date(2010, 12, 24),
       datetime.date(2010, 12, 31), datetime.date(2011, 1, 17),
       datetime.date(2011, 2, 21), datetime.date(2011, 5, 30),
       datetime.date(2011, 7, 4), datetime.date(2011, 9, 5),
       datetime.date(2011, 10, 10), datetime.date(2011, 11, 11),
       datetime.date(2011, 11, 24), datetime.date(2011, 12, 26),
       datetime.date(2012, 1, 2), datetime.date(2012, 1, 16),
       datetime.date(2012, 2, 20), datetime.date(2012, 5, 28),
       datetime.date(2012, 7, 4), datetime.date(2012, 9, 3),
       datetime.date(2012, 10, 8), datetime.date(2012, 11, 12),
       datetime.date(2012, 11, 22), datetime.date(2012, 12, 25),
       datetime.date(2013, 1, 1), datetime.date(2013, 1, 21),
       datetime.date(2013, 2, 18), datetime.date(2013, 5, 27),
       datetime.date(2013, 7, 4), datetime.date(2013, 9, 2),
       datetime.date(2013, 10, 14), datetime.date(2013, 11, 11),
       datetime.date(2013, 11, 28), datetime.date(2013, 12, 25),
       datetime.date(2014, 1, 1), datetime.date(2014, 1, 20),
       datetime.date(2014, 2, 17), datetime.date(2014, 5, 26),
       datetime.date(2014, 7, 4), datetime.date(2014, 9, 1),
       datetime.date(2014, 10, 13), datetime.date(2014, 11, 11),
       datetime.date(2014, 11, 27), datetime.date(2014, 12, 25),
       datetime.date(2015, 1, 1), datetime.date(2015, 1, 19),
       datetime.date(2015, 2, 16), datetime.date(2015, 5, 25),
       datetime.date(2015, 7, 3), datetime.date(2015, 9, 7),
       datetime.date(2015, 10, 12), datetime.date(2015, 11, 11),
       datetime.date(2015, 11, 26), datetime.date(2015, 12, 25),
       datetime.date(2016, 1, 1), datetime.date(2016, 1, 18),
       datetime.date(2016, 2, 15), datetime.date(2016, 5, 30),
       datetime.date(2016, 7, 4), datetime.date(2016, 9, 5),
       datetime.date(2016, 10, 10), datetime.date(2016, 11, 11),
       datetime.date(2016, 11, 24), datetime.date(2016, 12, 26),
       datetime.date(2017, 1, 2), datetime.date(2017, 1, 16),
       datetime.date(2017, 2, 20), datetime.date(2017, 5, 29),
       datetime.date(2017, 7, 4), datetime.date(2017, 9, 4),
       datetime.date(2017, 10, 9), datetime.date(2017, 11, 10),
       datetime.date(2017, 11, 23), datetime.date(2017, 12, 25),
       datetime.date(2018, 1, 1), datetime.date(2018, 1, 15),
       datetime.date(2018, 2, 19), datetime.date(2018, 5, 28),
       datetime.date(2018, 7, 4), datetime.date(2018, 9, 3),
       datetime.date(2018, 10, 8), datetime.date(2018, 11, 12),
       datetime.date(2018, 11, 22), datetime.date(2018, 12, 25),
       datetime.date(2019, 1, 1), datetime.date(2019, 1, 21),
       datetime.date(2019, 2, 18), datetime.date(2019, 5, 27),
       datetime.date(2019, 7, 4), datetime.date(2019, 9, 2),
       datetime.date(2019, 10, 14), datetime.date(2019, 11, 11),
       datetime.date(2019, 11, 28), datetime.date(2019, 12, 25),
       datetime.date(2020, 1, 1), datetime.date(2020, 1, 20),
       datetime.date(2020, 2, 17), datetime.date(2020, 5, 25),
       datetime.date(2020, 7, 3), datetime.date(2020, 9, 7),
       datetime.date(2020, 10, 12), datetime.date(2020, 11, 11),
       datetime.date(2020, 11, 26), datetime.date(2020, 12, 25),
       datetime.date(2021, 1, 1), datetime.date(2021, 1, 18),
       datetime.date(2021, 2, 15), datetime.date(2021, 5, 31),
       datetime.date(2021, 7, 5), datetime.date(2021, 9, 6),
       datetime.date(2021, 10, 11), datetime.date(2021, 11, 11),
       datetime.date(2021, 11, 25), datetime.date(2021, 12, 24),
       datetime.date(2021, 12, 31), datetime.date(2022, 1, 17),
       datetime.date(2022, 2, 21), datetime.date(2022, 5, 30)],
      dtype=object)

In [162]:
pd.Series(df2.index).dt.date.isin(list(obsholidays.date))

0          True
1          True
2          True
3          True
4          True
          ...
109530    False
109531    False
109532    False
109533    False
109534    False
Name: datetime, Length: 109535, dtype: bool

**Notes:** both these really seemed to need to be converted to dates, then compared

In [169]:
#convert index to series to grabe date then use isin 
#(needs to be series, else getting date converts to Numpy array which can't use isin *insert dramatic sigh here*
pd.Series(df2.index).dt.date.isin(obsholidays.date).astype(int)

0         1
1         1
2         1
3         1
4         1
         ..
109530    0
109531    0
109532    0
109533    0
109534    0
Name: datetime, Length: 109535, dtype: int64

In [178]:
#let's try this again!
df2['is_obs_holiday'] = pd.Series(df2.index,index=df2.index).dt.date.isin(obsholidays.date).astype(int)

In [179]:
df2.is_obs_holiday.mean()

0.027160268407358377

#### Combine prep into function

In [180]:
from pandas.tseries.holiday import USFederalHolidayCalendar

def create_day_columns(df2):
    '''
    Expects the cleaned ERCOT dataframe, returns the dataframe with new columns for:
    - dow: Day of week (category EX: Monday)
    - is_weekday: 1 if day is a weekday (M-F), else 0
    
    '''
    #create day of week category
    df2['dow'] = df2.index.day_name()
    #create bool is_weekday column
    df2['is_weekday'] = df2.dow.apply(lambda x: 0 if x in (['Saturday','Sunday']) else 1)
    
    #get holiday information
    start = df2.index[0] - datetime.timedelta(days=1) #this is need b/c it will skip 1/1/2010 (I think b/c it starts at one hour into that day)
    end = df2.index[-1] + datetime.timedelta(days=1)
    obsholidays = cal.holidays(start, end) #returns datetime index
    #Create is observed holiday column
    df2['is_obs_holiday'] = pd.Series(df2.index,index=df2.index).dt.date.isin(obsholidays.date).astype(int)
    
    return df2

In [181]:
test_holiday = pd.read_csv('coast_df.csv')
test_holiday = clean_ercot_datetime(test_holiday)
test_holiday = create_day_columns(test_holiday)
test_holiday

                       ercot_load       dow  is_weekday  is_obs_holiday
datetime
2010-01-01 01:00:00   7775.456846    Friday           1               1
2010-01-01 02:00:00   7704.815982    Friday           1               1
2010-01-01 03:00:00   7650.575724    Friday           1               1
2010-01-01 04:00:00   7666.708317    Friday           1               1
2010-01-01 05:00:00   7744.960869    Friday           1               1
...                           ...       ...         ...             ...
2022-06-30 20:00:00  14700.132848  Thursday           1               0
2022-06-30 21:00:00  14637.633680  Thursday           1               0
2022-06-30 22:00:00  14543.743791  Thursday           1               0
2022-06-30 23:00:00  14065.386852  Thursday           1               0
2022-07-01 00:00:00  13484.378935    Friday           1               0

[109535 rows x 4 columns]

### Combine into Prep Ercot function

In [182]:
def prep_ercot():
    '''
    Preps and the ercot dataframe - requires coast_df.csv file in working directory
    
    Returns: Pandas Dataframe
    '''
    #load ercot data
    df = pd.read_csv('coast_df.csv')
    
    #clean up datetime info
    df = clean_ercot_datetime(df)
    
    #create new day type features
    df = create_day_columns(df)
    
    return(df)

##### Test function

In [183]:
df = prep_ercot()

In [184]:
df

                       ercot_load       dow  is_weekday  is_obs_holiday
datetime
2010-01-01 01:00:00   7775.456846    Friday           1               1
2010-01-01 02:00:00   7704.815982    Friday           1               1
2010-01-01 03:00:00   7650.575724    Friday           1               1
2010-01-01 04:00:00   7666.708317    Friday           1               1
2010-01-01 05:00:00   7744.960869    Friday           1               1
...                           ...       ...         ...             ...
2022-06-30 20:00:00  14700.132848  Thursday           1               0
2022-06-30 21:00:00  14637.633680  Thursday           1               0
2022-06-30 22:00:00  14543.743791  Thursday           1               0
2022-06-30 23:00:00  14065.386852  Thursday           1               0
2022-07-01 00:00:00  13484.378935    Friday           1               0

[109535 rows x 4 columns]

In [185]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 109535 entries, 2010-01-01 01:00:00 to 2022-07-01 00:00:00
Data columns (total 4 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   ercot_load      109534 non-null  float64
 1   dow             109535 non-null  object
 2   is_weekday      109535 non-null  int64
 3   is_obs_holiday  109535 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 4.2+ MB

In [186]:
#STORE for now
df.to_csv('prepped_ercot.csv')

In [187]:
#now confirm I can pull it
test = pd.read_csv('prepped_ercot.csv')
test

,datetime,ercot_load,dow,is_weekday,is_obs_holiday
0,2010-01-01 01:00:00,7775.456846,Friday,1,1
1,2010-01-01 02:00:00,7704.815982,Friday,1,1
2,2010-01-01 03:00:00,7650.575724,Friday,1,1
3,2010-01-01 04:00:00,7666.708317,Friday,1,1
4,2010-01-01 05:00:00,7744.960869,Friday,1,1
...,...,...,...,...,...
109530,2022-06-30 20:00:00,14700.132848,Thursday,1,0
109531,2022-06-30 21:00:00,14637.633680,Thursday,1,0
109532,2022-06-30 22:00:00,14543.743791,Thursday,1,0
109533,2022-06-30 23:00:00,14065.386852,Thursday,1,0
109534,2022-07-01 00:00:00,13484.378935,Friday,1,0

In [188]:
#best pull method
test = pd.read_csv('prepped_ercot.csv',index_col='datetime')
test

                       ercot_load       dow  is_weekday  is_obs_holiday
datetime
2010-01-01 01:00:00   7775.456846    Friday           1               1
2010-01-01 02:00:00   7704.815982    Friday           1               1
2010-01-01 03:00:00   7650.575724    Friday           1               1
2010-01-01 04:00:00   7666.708317    Friday           1               1
2010-01-01 05:00:00   7744.960869    Friday           1               1
...                           ...       ...         ...             ...
2022-06-30 20:00:00  14700.132848  Thursday           1               0
2022-06-30 21:00:00  14637.633680  Thursday           1               0
2022-06-30 22:00:00  14543.743791  Thursday           1               0
2022-06-30 23:00:00  14065.386852  Thursday           1               0
2022-07-01 00:00:00  13484.378935    Friday           1               0

[109535 rows x 4 columns]

In [189]:
test.info()

<class 'pandas.core.frame.DataFrame'>
Index: 109535 entries, 2010-01-01 01:00:00 to 2022-07-01 00:00:00
Data columns (total 4 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   ercot_load      109534 non-null  float64
 1   dow             109535 non-null  object
 2   is_weekday      109535 non-null  int64
 3   is_obs_holiday  109535 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 4.2+ MB

In [192]:
test.index

Index(['2010-01-01 01:00:00', '2010-01-01 02:00:00', '2010-01-01 03:00:00',
       '2010-01-01 04:00:00', '2010-01-01 05:00:00', '2010-01-01 06:00:00',
       '2010-01-01 07:00:00', '2010-01-01 08:00:00', '2010-01-01 09:00:00',
       '2010-01-01 10:00:00',
       ...
       '2022-06-30 15:00:00', '2022-06-30 16:00:00', '2022-06-30 17:00:00',
       '2022-06-30 18:00:00', '2022-06-30 19:00:00', '2022-06-30 20:00:00',
       '2022-06-30 21:00:00', '2022-06-30 22:00:00', '2022-06-30 23:00:00',
       '2022-07-01 00:00:00'],
      dtype='object', name='datetime', length=109535)

In [194]:
test2 = pd.read_csv('prepped_ercot.csv',index_col='datetime',parse_dates=['datetime'])

In [195]:
test2.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 109535 entries, 2010-01-01 01:00:00 to 2022-07-01 00:00:00
Data columns (total 4 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   ercot_load      109534 non-null  float64
 1   dow             109535 non-null  object
 2   is_weekday      109535 non-null  int64
 3   is_obs_holiday  109535 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 4.2+ MB

In [196]:
def get_ercot_df():
    '''
    Retrieves ERCOT data from local csv, and returns as dataframe
    '''
    return pd.read_csv('prepped_ercot.csv',index_col='datetime',parse_dates=['datetime'])

In [197]:
get_ercot_df().info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 109535 entries, 2010-01-01 01:00:00 to 2022-07-01 00:00:00
Data columns (total 4 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   ercot_load      109534 non-null  float64
 1   dow             109535 non-null  object
 2   is_weekday      109535 non-null  int64
 3   is_obs_holiday  109535 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 4.2+ MB

In [201]:
test2[test2.ercot_load.isna()]

            ercot_load     dow  is_weekday  is_obs_holiday
datetime
2016-11-07         NaN  Monday           1               0

In [205]:
test2['2016-11-06':'2016-11-07']

                       ercot_load     dow  is_weekday  is_obs_holiday
datetime
2016-11-06 00:00:00   9823.059300  Sunday           0               0
2016-11-06 01:00:00   9333.714877  Sunday           0               0
2016-11-06 02:00:00   8940.715464  Sunday           0               0
2016-11-06 02:00:00   8586.846227  Sunday           0               0
2016-11-06 03:00:00   8421.796870  Sunday           0               0
2016-11-06 04:00:00   8315.693497  Sunday           0               0
2016-11-06 05:00:00   8298.451888  Sunday           0               0
2016-11-06 06:00:00   8378.409884  Sunday           0               0
2016-11-06 07:00:00   8574.723399  Sunday           0               0
2016-11-06 08:00:00   8727.975197  Sunday           0               0
2016-11-06 09:00:00   9250.127880  Sunday           0               0
2016-11-06 10:00:00   9710.042373  Sunday           0               0
2016-11-06 11:00:00  10166.955143  Sunday           0               0
2016-11-06 12:00:00  10705.692924  Sunday           0               0
2016-11-06 13:00:00  11257.071051  Sunday           0               0
2016-11-06 14:00:00  11593.861939  Sunday           0               0
2016-11-06 15:00:00  11668.452052  Sunday           0               0
2016-11-06 16:00:00  11505.324075  Sunday           0               0
2016-11-06 17:00:00  11366.450501  Sunday           0               0
2016-11-06 18:00:00  11568.347403  Sunday           0               0
2016-11-06 19:00:00  11817.812064  Sunday           0               0
2016-11-06 20:00:00  11659.888806  Sunday           0               0
2016-11-06 21:00:00  11325.212073  Sunday           0               0
2016-11-06 22:00:00  10847.035095  Sunday           0               0
2016-11-06 23:00:00  10138.494300  Sunday           0               0
2016-11-07 00:00:00           NaN  Monday           1               0
2016-11-07 01:00:00   8961.697811  Monday           1               0
2016-11-07 02:00:00   8719.073733  Monday           1               0
2016-11-07 03:00:00   8602.533316  Monday           1               0
2016-11-07 04:00:00   8623.895250  Monday           1               0
2016-11-07 05:00:00   8856.470136  Monday           1               0
2016-11-07 06:00:00   9469.276490  Monday           1               0
2016-11-07 07:00:00  10233.657987  Monday           1               0
2016-11-07 08:00:00  10384.558931  Monday           1               0
2016-11-07 09:00:00  10696.434427  Monday           1               0
2016-11-07 10:00:00  11027.490313  Monday           1               0
2016-11-07 11:00:00  11292.883292  Monday           1               0
2016-11-07 12:00:00  11646.538266  Monday           1               0
2016-11-07 13:00:00  11884.506494  Monday           1               0
2016-11-07 14:00:00  12190.059245  Monday           1               0
2016-11-07 15:00:00  12377.546400  Monday           1               0
2016-11-07 16:00:00  12406.601813  Monday           1               0
2016-11-07 17:00:00  12332.283267  Monday           1               0
2016-11-07 18:00:00  12191.523125  Monday           1               0
2016-11-07 19:00:00  12280.656551  Monday           1               0
2016-11-07 20:00:00  12079.225448  Monday           1               0
2016-11-07 21:00:00  11699.602943  Monday           1               0
2016-11-07 22:00:00  11018.478786  Monday           1               0
2016-11-07 23:00:00  10154.993885  Monday           1               0